MarlinFirmware/Marlin/Marlin/src/HAL/HAL_LPC1768/LPC1768_PWM.cpp
  uint32_t PR = (CLKPWR_GetPCLK(CLKPWR_PCLKSEL_PWM1) / 1000000) - 1;      // Prescalar to create 1 MHz output

  LPC_PWM1->MR0  = LPC_PWM1_MR0;                                          // TC resets every 19,999 + 1 cycles - sets PWM cycle(Ton+Toff) to 20 mS
  // MR0 must be set before TCR enables the PWM
  LPC_PWM1->TCR  = _BV(SBIT_CNTEN) | _BV(SBIT_CNTRST) | _BV(SBIT_PWMEN);  // Enable counters, reset counters, set mode to PWM
  CBI(LPC_PWM1->TCR, SBIT_CNTRST);                                        // Take counters out of reset
  LPC_PWM1->PR   = PR;
  LPC_PWM1->MCR  = _BV(SBIT_PWMMR0R) | _BV(0);                            // Reset TC if it matches MR0, disable all interrupts except for MR0
  LPC_PWM1->CTCR = 0;                                                     // Disable counter mode (enable PWM mode)
  LPC_PWM1->LER  = 0x07F;                                                 // Set the latch Enable Bits to load the new Match Values for MR0 - MR6
  LPC_PWM1->PCR  = 0;                                                     // Single edge mode for all channels, PWM1 control of outputs off

  ////  interrupt controlled PWM setup

  LPC_SC->PCONP |= 1 << 23;  // power on timer3
  HAL_PWM_TIMER->PR = PR;
  HAL_PWM_TIMER->MCR = 0x0B;              // Interrupt on MR0 & MR1, reset on MR0
  HAL_PWM_TIMER->MR0 = LPC_PWM1_MR0;
  HAL_PWM_TIMER->MR1 = 0;
  HAL_PWM_TIMER->TCR = _BV(0);       // enable
  NVIC_EnableIRQ(HAL_PWM_TIMER_IRQn);
  NVIC_SetPriority(HAL_PWM_TIMER_IRQn, NVIC_EncodePriority(0, 4, 0));
}


bool ISR_table_update = false;  // flag to tell the ISR that the tables need to be updated & swapped
uint8_t ISR_index = 0;          // index used by ISR to skip already actioned entries
#define COPY_ACTIVE_TABLE    for (uint8_t i = 0; i < NUM_ISR_PWMS ; i++) work_table[i] = active_table[i]
uint32_t first_MR1_value = LPC_PWM1_MR0 + 1;

void LPC1768_PWM_sort(void) {

  for (uint8_t i = NUM_ISR_PWMS; --i;) {  // (bubble) sort table by microseconds
    bool didSwap = false;
    PWM_map temp;
    for (uint16_t j = 0; j < i; ++j) {
      if (work_table[j].microseconds > work_table[j + 1].microseconds) {
        temp = work_table[j + 1];
        work_table[j + 1] = work_table[j];
        work_table[j] = temp;
        didSwap = true;
      }
    }
    if (!didSwap) break;
  }
}

bool LPC1768_PWM_attach_pin(pin_t pin, uint32_t min /* = 1 */, uint32_t max /* = (LPC_PWM1_MR0 - 1) */, uint8_t servo_index /* = 0xFF */) {

  pin = GET_PIN_MAP_PIN(GET_PIN_MAP_INDEX(pin & 0xFF));  // Sometimes the upper byte is garbled

////  direct control PWM code
  switch (pin) {
    case P1_23:                                       // MKS Sbase Servo 0, PWM1 channel 4  (J3-8 PWM1.4)
      direct_table[P1_23_PWM_channel - 1].min = min;
      direct_table[P1_23_PWM_channel - 1].max = smallest(max, LPC_PWM1_MR0 - MR0_MARGIN);
      direct_table[P1_23_PWM_channel - 1].assigned = true;
      return true;
    case P1_20:                                       // Servo 0, PWM1 channel 2  (Pin 11  P1.20 PWM1.2)
      direct_table[P1_20_PWM_channel - 1].min = min;
      direct_table[P1_20_PWM_channel - 1].max = smallest(max, LPC_PWM1_MR0 - MR0_MARGIN);
      direct_table[P1_20_PWM_channel - 1].assigned = true;
      return true;
    case P1_21:                                       // Servo 1, PWM1 channel 3  (Pin 6  P1.21 PWM1.3)
      direct_table[P1_21_PWM_channel - 1].min = min;
      direct_table[P1_21_PWM_channel - 1].max = smallest(max, LPC_PWM1_MR0 - MR0_MARGIN);
      direct_table[P1_21_PWM_channel - 1].assigned = true;
      return true;
    case P1_18:                                       // Servo 3, PWM1 channel 1 (Pin 4  P1.18 PWM1.1)
      direct_table[P1_18_PWM_channel - 1].min = min;
      direct_table[P1_18_PWM_channel - 1].max = smallest(max, LPC_PWM1_MR0 - MR0_MARGIN);
      direct_table[P1_18_PWM_channel - 1].assigned = true;
      return true;
    case P2_04:                                       // D9 FET, PWM1 channel 5  (Pin 9  P2_04 PWM1.5)
      direct_table[P2_04_PWM_channel - 1].min = min;
      direct_table[P2_04_PWM_channel - 1].max = smallest(max, LPC_PWM1_MR0 - MR0_MARGIN);
      direct_table[P2_04_PWM_channel - 1].assigned = true;
      return true;
    case P2_05:                                       // D10 FET, PWM1 channel 6 (Pin 10  P2_05 PWM1.6)
      direct_table[P2_05_PWM_channel - 1].min = min;
      direct_table[P2_05_PWM_channel - 1].max = smallest(max, LPC_PWM1_MR0 - MR0_MARGIN);
      direct_table[P2_05_PWM_channel - 1].assigned = true;
      return true;
  }

////  interrupt controlled PWM code
  NVIC_DisableIRQ(HAL_PWM_TIMER_IRQn);    // make it safe to update the active table
                                 // OK to update the active table because the
                                 // ISR doesn't use any of the changed items

  // We NEED memory barriers to ensure Interrupts are actually disabled!
  // ( https://dzone.com/articles/nvic-disabling-interrupts-on-arm-cortex-m-and-the )
  __DSB();
  __ISB();

  if (ISR_table_update) //use work table if that's the newest
    temp_table = work_table;
  else
    temp_table = active_table;

  uint8_t slot = 0;
  for (uint8_t i = 0; i < NUM_ISR_PWMS; i++)         // see if already in table
    if (temp_table[i].pin == pin) {
      NVIC_EnableIRQ(HAL_PWM_TIMER_IRQn);  // re-enable PWM interrupts
      return 1;
    }

  for (uint8_t i = 1; (i < NUM_ISR_PWMS + 1) && !slot; i++)         // find empty slot
    if ( !(temp_table[i - 1].set_register)) { slot = i; break; }  // any item that can't be zero when active or just attached is OK

  if (!slot) {
    NVIC_EnableIRQ(HAL_PWM_TIMER_IRQn);  // re-enable PWM interrupts
    return 0;
  }

  slot--;  // turn it into array index

  temp_table[slot].pin          = pin;     // init slot
  temp_table[slot].set_register = &LPC_GPIO(LPC1768_PIN_PORT(pin))->FIOSET;
  temp_table[slot].clr_register = &LPC_GPIO(LPC1768_PIN_PORT(pin))->FIOCLR;
  temp_table[slot].write_mask   = LPC_PIN(LPC1768_PIN_PIN(pin));
  temp_table[slot].min          = min;
  temp_table[slot].max          = max;                // different max for ISR PWMs than for direct PWMs
  temp_table[slot].servo_index  = servo_index;
  temp_table[slot].active_flag  = false;

  NVIC_EnableIRQ(HAL_PWM_TIMER_IRQn);  // re-enable PWM interrupts

  return 1;
}


bool LPC1768_PWM_detach_pin(pin_t pin) {

  pin = GET_PIN_MAP_PIN(GET_PIN_MAP_INDEX(pin & 0xFF));

////  direct control PWM code
  switch (pin) {
    case P1_23:                                       // MKS Sbase Servo 0, PWM1 channel 4  (J3-8 PWM1.4)
      if (!direct_table[P1_23_PWM_channel - 1].assigned) return false;
      CBI(LPC_PWM1->PCR, 8 + P1_23_PWM_channel);      // disable PWM1 module control of this pin
      LPC_PINCON->PINSEL3 &= ~(0x3 <<  14);           // return pin to general purpose I/O
      direct_table[P1_23_PWM_channel - 1].assigned = false;
      return true;
    case P1_20:                                       // Servo 0, PWM1 channel 2  (Pin 11  P1.20 PWM1.2)
      if (!direct_table[P1_20_PWM_channel - 1].assigned) return false;
      CBI(LPC_PWM1->PCR, 8 + P1_20_PWM_channel);      // disable PWM1 module control of this pin
      LPC_PINCON->PINSEL3 &= ~(0x3 <<  8);            // return pin to general purpose I/O
      direct_table[P1_20_PWM_channel - 1].assigned = false;
      return true;
    case P1_21:                                       // Servo 1, PWM1 channel 3  (Pin 6  P1.21 PWM1.3)
      if (!direct_table[P1_21_PWM_channel - 1].assigned) return false;
      CBI(LPC_PWM1->PCR, 8 + P1_21_PWM_channel);      // disable PWM1 module control of this pin
      LPC_PINCON->PINSEL3 &= ~(0x3 << 10);            // return pin to general purpose I/O
      direct_table[P1_21_PWM_channel - 1].assigned = false;
      return true;
    case P1_18:                                       // Servo 3, PWM1 channel 1 (Pin 4  P1.18 PWM1.1)
      if (!direct_table[P1_18_PWM_channel - 1].assigned) return false;
      CBI(LPC_PWM1->PCR, 8 + P1_18_PWM_channel);      // disable PWM1 module control of this pin
      LPC_PINCON->PINSEL3 &= ~(0x3 <<  4);            // return pin to general purpose I/O
      direct_table[P1_18_PWM_channel - 1].assigned = false;
      return true;
    case P2_04:                                       // D9 FET, PWM1 channel 5  (Pin 9  P2_04 PWM1.5)
      if (!direct_table[P2_04_PWM_channel - 1].assigned) return false;
      CBI(LPC_PWM1->PCR, 8 + P2_04_PWM_channel);      // disable PWM1 module control of this pin
      LPC_PINCON->PINSEL4 &= ~(0x3 << 10);            // return pin to general purpose I/O
      direct_table[P2_04_PWM_channel - 1].assigned = false;
      return true;
    case P2_05:                                       // D10 FET, PWM1 channel 6 (Pin 10  P2_05 PWM1.6)
      if (!direct_table[P2_05_PWM_channel - 1].assigned) return false;
      CBI(LPC_PWM1->PCR, 8 + P2_05_PWM_channel);      // disable PWM1 module control of this pin
      LPC_PINCON->PINSEL4 &= ~(0x3 <<  4);            // return pin to general purpose I/O
      direct_table[P2_05_PWM_channel - 1].assigned = false;
      return true;
  }

////  interrupt controlled PWM code
  NVIC_DisableIRQ(HAL_PWM_TIMER_IRQn);

  // We NEED memory barriers to ensure Interrupts are actually disabled!
  // ( https://dzone.com/articles/nvic-disabling-interrupts-on-arm-cortex-m-and-the )
  __DSB();
  __ISB();

  if (ISR_table_update) {
    ISR_table_update = false;    // don't update yet - have another update to do
    NVIC_EnableIRQ(HAL_PWM_TIMER_IRQn);  // re-enable PWM interrupts
  }
  else {
    NVIC_EnableIRQ(HAL_PWM_TIMER_IRQn);  // re-enable PWM interrupts
    COPY_ACTIVE_TABLE;  // copy active table into work table
  }

  uint8_t slot = 0xFF;
  for (uint8_t i = 0; i < NUM_ISR_PWMS; i++) {        // find slot
    if (work_table[i].pin == pin) {
      slot = i;
      break;
    }
  }
  if (slot == 0xFF)    // return error if pin not found
    return false;

  work_table[slot] = {0, 0, 0, 0, 0, 0, 0, 0, 0};

