MarlinFirmware/Marlin/Marlin/src/HAL/HAL_LPC1768/LPC1768_PWM.cpp
  LPC1768_PWM_sort();    // sort table by microseconds
  ISR_table_update = true;
  return true;
}

// value is 0-20,000 microseconds (0% to 100% duty cycle)
// servo routine provides values in the 544 - 2400 range
bool LPC1768_PWM_write(pin_t pin, uint32_t value) {

  pin = GET_PIN_MAP_PIN(GET_PIN_MAP_INDEX(pin & 0xFF));

////  direct control PWM code
  switch (pin) {
    case P1_23:                                                           // MKS Sbase Servo 0, PWM1 channel 4  (J3-8 PWM1.4)
      if (!direct_table[P1_23_PWM_channel - 1].assigned) return false;
      LPC_PWM1->PCR |=  _BV(8 + P1_23_PWM_channel); // enable PWM1 module control of this pin
      LPC_PINCON->PINSEL3 = 0x2 <<  14;             // must set pin function AFTER setting PCR
      // load the new time value
      LPC_PWM1->MR4 = biggest(smallest(value, direct_table[P1_23_PWM_channel - 1].max), direct_table[P1_23_PWM_channel - 1].min);
      LPC_PWM1->LER = 0x1 << P1_23_PWM_channel; // Set the latch Enable Bit to load the new Match Value on the next MR0
      return true;
    case P1_20:                                                           // Servo 0, PWM1 channel 2 (Pin 11  P1.20 PWM1.2)
      if (!direct_table[P1_20_PWM_channel - 1].assigned) return false;
      LPC_PWM1->PCR |=  _BV(8 + P1_20_PWM_channel); // enable PWM1 module control of this pin
      LPC_PINCON->PINSEL3 |= 0x2 <<  8;             // must set pin function AFTER setting PCR
      // load the new time value
      LPC_PWM1->MR2 = biggest(smallest(value, direct_table[P1_20_PWM_channel - 1].max), direct_table[P1_20_PWM_channel - 1].min);
      LPC_PWM1->LER = 0x1 << P1_20_PWM_channel; // Set the latch Enable Bit to load the new Match Value on the next MR0
      return true;
    case P1_21:                                                           // Servo 1, PWM1 channel 3 (Pin 6  P1.21 PWM1.3)
      if (!direct_table[P1_21_PWM_channel - 1].assigned) return false;
      LPC_PWM1->PCR |=  _BV(8 + P1_21_PWM_channel); // enable PWM1 module control of this pin
      LPC_PINCON->PINSEL3 |= 0x2 << 10;              // must set pin function AFTER setting PCR
      // load the new time value
      LPC_PWM1->MR3 = biggest(smallest(value, direct_table[P1_21_PWM_channel - 1].max), direct_table[P1_21_PWM_channel - 1].min);
      LPC_PWM1->LER = 0x1 << P1_21_PWM_channel; // Set the latch Enable Bit to load the new Match Value on the next MR0
      return true;
    case P1_18:                                                           // Servo 3, PWM1 channel 1 (Pin 4  P1.18 PWM1.1)
      if (!direct_table[P1_18_PWM_channel - 1].assigned) return false;
      LPC_PWM1->PCR |=  _BV(8 + P1_18_PWM_channel); // enable PWM1 module control of this pin
      LPC_PINCON->PINSEL3 |= 0x2 <<  4;             // must set pin function AFTER setting PCR
      // load the new time value
      LPC_PWM1->MR1 = biggest(smallest(value, direct_table[P1_18_PWM_channel - 1].max), direct_table[P1_18_PWM_channel - 1].min);
      LPC_PWM1->LER = 0x1 << P1_18_PWM_channel; // Set the latch Enable Bit to load the new Match Value on the next MR0
      return true;
    case P2_04:                                                           // D9 FET, PWM1 channel 5 (Pin 9  P2_04 PWM1.5)
      if (!direct_table[P2_04_PWM_channel - 1].assigned) return false;
      LPC_PWM1->PCR |=  _BV(8 + P2_04_PWM_channel); // enable PWM1 module control of this pin
      LPC_PINCON->PINSEL4 |= 0x1 <<  8;             // must set pin function AFTER setting PCR
      // load the new time value
      LPC_PWM1->MR5 = biggest(smallest(value, direct_table[P2_04_PWM_channel - 1].max), direct_table[P2_04_PWM_channel - 1].min);
      LPC_PWM1->LER = 0x1 << P2_04_PWM_channel; // Set the latch Enable Bit to load the new Match Value on the next MR0
      return true;
    case P2_05:                                                           // D10 FET, PWM1 channel 6 (Pin 10  P2_05 PWM1.6)
      if (!direct_table[P2_05_PWM_channel - 1].assigned) return false;
      LPC_PWM1->PCR |=  _BV(8 + P2_05_PWM_channel); // enable PWM1 module control of this pin
      LPC_PINCON->PINSEL4 |= 0x1 << 10;             // must set pin function AFTER setting PCR
      // load the new time value
      LPC_PWM1->MR6 = biggest(smallest(value, direct_table[P2_05_PWM_channel - 1].max), direct_table[P2_05_PWM_channel - 1].min);
      LPC_PWM1->LER = 0x1 << P2_05_PWM_channel; // Set the latch Enable Bit to load the new Match Value on the next MR0
      return true;
  }

////  interrupt controlled PWM code
  NVIC_DisableIRQ(HAL_PWM_TIMER_IRQn);

  // We NEED memory barriers to ensure Interrupts are actually disabled!
  // ( https://dzone.com/articles/nvic-disabling-interrupts-on-arm-cortex-m-and-the )
  __DSB();
  __ISB();

  if (!ISR_table_update)   // use the most up to date table
    COPY_ACTIVE_TABLE;  // copy active table into work table

  uint8_t slot = 0xFF;
  for (uint8_t i = 0; i < NUM_ISR_PWMS; i++)         // find slot
    if (work_table[i].pin == pin) { slot = i; break; }
  if (slot == 0xFF) {   // return error if pin not found
    NVIC_EnableIRQ(HAL_PWM_TIMER_IRQn);
    return false;
  }

  work_table[slot].microseconds = biggest(smallest(value, work_table[slot].max), work_table[slot].min);;
  work_table[slot].active_flag  = true;

  LPC1768_PWM_sort();    // sort table by microseconds
  ISR_table_update = true;

  NVIC_EnableIRQ(HAL_PWM_TIMER_IRQn);  // re-enable PWM interrupts
  return 1;
}


bool useable_hardware_PWM(pin_t pin) {

  pin = GET_PIN_MAP_PIN(GET_PIN_MAP_INDEX(pin & 0xFF));

  NVIC_DisableIRQ(HAL_PWM_TIMER_IRQn);

  // We NEED memory barriers to ensure Interrupts are actually disabled!
  // ( https://dzone.com/articles/nvic-disabling-interrupts-on-arm-cortex-m-and-the )
  __DSB();
  __ISB();

  bool return_flag = false;
  for (uint8_t i = 0; i < NUM_ISR_PWMS; i++)         // see if it's already setup
    if (active_table[i].pin == pin) return_flag = true;
  for (uint8_t i = 0; i < NUM_ISR_PWMS; i++)         // see if there is an empty slot
    if (!active_table[i].set_register) return_flag = true;
  NVIC_EnableIRQ(HAL_PWM_TIMER_IRQn);  // re-enable PWM interrupts
  return return_flag;
}


////////////////////////////////////////////////////////////////////////////////


#define PWM_LPC1768_ISR_SAFETY_FACTOR 5  // amount of time needed to guarantee MR1 count will be above TC
volatile bool in_PWM_isr = false;

HAL_PWM_TIMER_ISR {
  bool first_active_entry = true;
  uint32_t next_MR1_val;

  if (in_PWM_isr) goto exit_PWM_ISR;  // prevent re-entering this ISR
  in_PWM_isr = true;

  if (HAL_PWM_TIMER->IR & 0x01) {  // MR0 interrupt
    next_MR1_val = first_MR1_value;               // only used if have a blank ISR table
    if (ISR_table_update) {                       // new values have been loaded so swap tables
      temp_table = active_table;
      active_table = work_table;
      work_table = temp_table;
      ISR_table_update = false;
    }
  }
  HAL_PWM_TIMER->IR = 0x3F;  // clear all interrupts

  for (uint8_t i = 0; i < NUM_ISR_PWMS; i++) {
    if (active_table[i].active_flag) {
      if (first_active_entry) {
        first_active_entry = false;
        next_MR1_val = active_table[i].microseconds;
      }
      if (HAL_PWM_TIMER->TC < active_table[i].microseconds) {
        *active_table[i].set_register = active_table[i].write_mask;   // set pin high
      }
      else {
        *active_table[i].clr_register = active_table[i].write_mask;   // set pin low
        next_MR1_val = (i == NUM_ISR_PWMS -1)
          ? LPC_PWM1_MR0 + 1                  // done with table, wait for MR0
          : active_table[i + 1].microseconds; // set next MR1 interrupt?
      }
    }
  }
  if (first_active_entry) next_MR1_val = LPC_PWM1_MR0 + 1;  // empty table so disable MR1 interrupt
  HAL_PWM_TIMER->MR1 = biggest(next_MR1_val, HAL_PWM_TIMER->TC + PWM_LPC1768_ISR_SAFETY_FACTOR); // set next
  in_PWM_isr = false;

