MarlinFirmware/Marlin/Marlin/src/HAL/HAL_LPC1768/LPC1768_PWM.cpp
  exit_PWM_ISR:
  return;
}
#endif


/////////////////////////////////////////////////////////////////
/////////////////  HARDWARE FIRMWARE INTERACTION ////////////////
/////////////////////////////////////////////////////////////////

/**
 *  There are two distinct systems used for PWMs:
 *    directly controlled pins
 *    ISR controlled pins.
 *
 *  The two systems are independent of each other.  The use the same counter frequency so there's no
 *  translation needed when setting the time values.  The init, attach, detach and write routines all
 *  start with the direct pin code which is followed by the ISR pin code.
 *
 *  The PMW1 module handles the directly controlled pins.  Each directly controlled pin is associated
 *  with a match register (MR1 - MR6).  When the associated MR equals the module's TIMER/COUNTER (TC)
 *  then the pins is set to low.  The MR0 register controls the repetition rate.  When the TC equals
 *  MR0 then the TC is reset and ALL directly controlled pins are set high.  The resulting pulse widths
 *  are almost immune to system loading and ISRs.  No PWM1 interrupts are used.
 *
 *  The ISR controlled pins use the TIMER/COUNTER, MR0 and MR1 registers from one timer.  MR0 controls
 *  period of the controls the repetition rate.  When the TC equals MR0 then the TC is reset and an
 *  interrupt is generated. When the TC equals MR1 then an interrupt is generated.
 *
 *  Each interrupt does the following:
 *    1) Swaps the tables if it's a MR0 interrupt and the swap flag is set.  It then clears the swap flag.
 *    2) Scans the entire ISR table (it's been sorted low to high time)
 *         a. If its the first active entry then it grabs the time as a tentative time for MR1
 *         b. If active and TC is less than the time then it sets the pin high
 *         c. If active and TC is more than the time it sets the pin high
 *         d. On every entry that sets a pin low it grabs the NEXT entry's time for use as the next MR1.
 *            This results in MR1 being set to the time in the first active entry that does NOT set a
 *            pin low.
 *         e. If it's setting the last entry's pin low then it sets MR1 to a value bigger than MR0
 *         f. If no value has been grabbed for the next MR1 then it's an empty table and MR1 is set to a
 *            value greater than MR0
 */
